;Place localized text in this file
[PsiChamberScientistStaffSlot X2StaffSlotTemplate]
-EmptyText="OPEN: ENGINEER REQUIRED"
+EmptyText="OPEN: SCIENTIST REQUIRED"

[AWCScientistStaffSlot X2StaffSlotTemplate]
-EmptyText="OPEN: ENGINEER REQUIRED"
+EmptyText="OPEN: SCIENTIST REQUIRED"